"use strict";
// Об’єкт “Фірма” (використати члени-класи)
// Поля     назва фірми
//          дата заснування (рік, місяць)
//          послуги (назва послуги, вартість, термін виконання)
//          адреси філіалів (країна, місто, вулиця, номер будинку)
// Методи   визначення кількості років існування фірми
//          виведення всіх філіалів фірми у вказаному місті
//          виведення на екран послуг, що можуть бути виконані за вказану суму грошей та вказаний термін часу
if (confirm('Почати тестування?')) {
}
else {
    alert(`Нажаль ви відмовились від теста 😞`);
}
